Revit 2027 API
EnergyDataSettings.BuildingConstructionClass Property
 Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). Construction class of building as defined by: loose, medium, tight, or none.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HVACLoadConstructionClass BuildingConstructionClass { get; set; }
Public Property BuildingConstructionClass As HVACLoadConstructionClass
	Get
	Set
public:
property HVACLoadConstructionClass BuildingConstructionClass {
	HVACLoadConstructionClass get ();
	void set (HVACLoadConstructionClass value);
}
member BuildingConstructionClass : HVACLoadConstructionClass with get, set
Property Value
HVACLoadConstructionClass
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The building construction class does not fall within an appropriate range.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace